content-org/datalab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-11 Mon 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Vladimir Bajčeta" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd545504">1. IBM Power&#xa0;&#xa0;&#xa0;<span class="tag"><span class="_power">@power</span></span></a>
<ul>
<li><a href="#orgecba444">1.1. Installing Void Linux on IBM Power 740&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ibm">ibm</span>&#xa0;<span class="linux">linux</span></span></a>
<ul>
<li><a href="#org81c2442">1.1.1. Going for Void Linux</a></li>
<li><a href="#org1f26971">1.1.2. Making a bootable USB on Linux</a></li>
<li><a href="#orgc5dceff">1.1.3. Using HMC</a></li>
<li><a href="#org5c6ee5a">1.1.4. Installing Void Linux</a></li>
</ul>
</li>
<li><a href="#org1c2fd8c">1.2. IBM Power 740&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ibm">ibm</span></span></a>
<ul>
<li><a href="#org0589964">1.2.1. IBM Power terminology</a></li>
<li><a href="#org92fe5c2">1.2.2. Uses for this server?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd545504" class="outline-2">
<h2 id="orgd545504"><span class="section-number-2">1.</span> IBM Power&#xa0;&#xa0;&#xa0;<span class="tag"><span class="_power">@power</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgecba444" class="outline-3">
<h3 id="orgecba444"><span class="section-number-3">1.1.</span> Installing Void Linux on IBM Power 740&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ibm">ibm</span>&#xa0;<span class="linux">linux</span></span></h3>
<div class="outline-text-3" id="text-1-1">
</div>


<div id="outline-container-org81c2442" class="outline-4">
<h4 id="org81c2442"><span class="section-number-4">1.1.1.</span> Going for Void Linux</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Recently I switched from Ubuntu to <a href="https://voidlinux-ppc.org/">Void Linux</a> on all my boxes. Fortunately Void has great support for PPC.
I even have it installed on a Powerbook G3.
</p>

<p>
For running Linux on PPC you need to know if your CPU support little endian or big endian. PowerPC started as BE and only with Power8 did it fully support LE mode.
For a Power7 we need Void Linux ppc64 that is a BE version.
</p>

<p>
I prefer minimal installs and adding on packages that I need later so I went for <a href="https://repo.voidlinux-ppc.org/live/20210825/void-live-ppc64-20210825.iso.">void-live-ppc64-20210825.iso</a>.
</p>
</div>
</div>

<div id="outline-container-org1f26971" class="outline-4">
<h4 id="org1f26971"><span class="section-number-4">1.1.2.</span> Making a bootable USB on Linux</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>insert the drive</li>
<li>check the drive id with <code>dmesg</code>, sdb in my case</li>
<li>unmount the drive if you have an automount daemon running</li>
<li>copy the iso to usb with <code>dd</code></li>
</ol>


<pre class="example">
umount /dev/sdb
dd if=void-live-ppc64-20210825.iso of=/dev/sdb bs=1m
</pre>
</div>
</div>

<div id="outline-container-orgc5dceff" class="outline-4">
<h4 id="orgc5dceff"><span class="section-number-4">1.1.3.</span> Using HMC</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
I don't have the RJ45 serial cable so I had to install HMC in order to use a virtual console for the install.
I found that the <code>HMC_Recovery_V8R870_1_x86.iso</code> can be installed in a VM and used to manage the server.
</p>


<p>
Default user for HMC is <code>hscroot</code> and password is <code>abc123</code>.
</p>

<p>
I couldn't get the virtual console running in a browser so I had to ssh into the HMC VM and use <code>vtmenu</code>.
</p>
</div>
</div>

<div id="outline-container-org5c6ee5a" class="outline-4">
<h4 id="org5c6ee5a"><span class="section-number-4">1.1.4.</span> Installing Void Linux</h4>
<div class="outline-text-4" id="text-1-1-4">
<ol class="org-ol">
<li>Create a new LPAR and assign the usb controller to it.</li>
<li>Don't forget to plug in the USB you created before.</li>
<li>Boot into Open Firmware and type:</li>
</ol>
<pre class="example">
devalias ud /pci@f2000000/usb@1b/disk@1
boot ud:,\boot\grub.img
</pre>
<p>
You might have to change the devalias command to fit your setup. Use <code>ls</code> and <code>dev</code> commands in OF to navigate and find your device.
</p>
<ol class="org-ol">
<li>Grub prompt should appear.</li>
</ol>
<p>
Boot takes a lot of time, loading the kernel and initrd can take 10-20 minutes easy. It's much faster after the install.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c2fd8c" class="outline-3">
<h3 id="org1c2fd8c"><span class="section-number-3">1.2.</span> IBM Power 740&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ibm">ibm</span></span></h3>
<div class="outline-text-3" id="text-1-2">
<p>
I saw the server on an auction with just a few minutes to spare. Always liked PPC for some reason, so it peaked my interest. Ad was sparse with info, 2 cpus, 384GB, no disks. No clue on which CPUs, was it really 384GB ram&#x2026; Anyway I went for it.
</p>

<p>
Turns out it was a top of the line box.
</p>

<p>
Specs:
</p>
<ul class="org-ul">
<li>2 x 8 core Power7 @3.55GHz</li>
<li>384GB ram</li>
<li>4 x 146GB  15k SAS</li>
</ul>

<p>
All CPUs and ram activated and has a PowerVM license.
</p>

<p>
Power consumption is not so good, it idles at around 360w-400w. I'll try pulling out some drives and PCIe cards that sit unused. It might take the consumption down by 20-40w.
In comparison a Dell R620 can idle at around 100w.
</p>

<p>
One of the selling points for IBM Power servers is the massive IO that they support. Power 740 is a mid level server from the series and it can support up to 4 IBM 5802 enclosures for a total of 4x 18 SAS drives and 4x 10 PCIe slots. I am not aware of any x86 system offering such expansion.
</p>
</div>

<div id="outline-container-org0589964" class="outline-4">
<h4 id="org0589964"><span class="section-number-4">1.2.1.</span> IBM Power terminology</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
PowerVM - Hypervisor, like KVM or VMware on x86.
</p>

<p>
LPAR - Logical partition, what we would today call a VM.
</p>

<p>
Hardware Management Console - IBM appliance or VM that is used to manage virtualization of PowerVM
</p>

<p>
VIOS - Virtual IO Server, AIX instance that shares physical resources as virtual ones to other LPARs.
</p>

<p>
IBM Power7 servers always run a hypervisor, even when all resources are dedicated to one LPAR.
</p>
</div>
</div>

<div id="outline-container-org92fe5c2" class="outline-4">
<h4 id="org92fe5c2"><span class="section-number-4">1.2.2.</span> Uses for this server?</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Getting AIX requires a service agreement with IBM, so that is out the question.
</p>

<p>
It might serve as a build server for Void Linux PPC BE packages, since the maintaner can't afford the time to continue. Not sure if I can, but I like the thought.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vladimir Bajčeta</p>
<p class="date">Created: 2022-04-11 Mon 17:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
